repaso_nuevo22/app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $cliente = new ClientesModel();
        $datos ['datos']=$cliente->findAll();