repaso_nuevo22/app/Controllers/LineasTelefonicasController.php

SELECT *
FROM `lineas_telefonicas`
---
    public  function index(): string
    {
        $lineas = new LineasTelefonicasModel();
        $datos ['datos']=$lineas->findAll();